---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.WireConduitTypes
source: html/62dab13d-2046-6d3d-59af-2a8cf4b7fd74.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.WireConduitTypes Property

Get electrical conduit types information of the project.

## Syntax (C#)
```csharp
public WireConduitTypeSet WireConduitTypes { get; }
```